In [1]:
%matplotlib inline
import pandas as pd

In [3]:
from IPython.core.display import HTML
# css = open('style-table.css').read() + open('style-notebook.css').read()
# HTML('<style>{}</style>'.format(css))

In [4]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [5]:
titles.size

489828

### What are the earliest two films listed in the titles dataframe?

In [7]:
titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [6]:
titles[titles.title=='Hamlet'].count()

title    20
year     20
dtype: int64

### How many movies are titled "North by Northwest"?

In [9]:

titles[titles.title=='North by Northwest'].count()

title    1
year     1
dtype: int64

### When was the first movie titled "Hamlet" made?

In [10]:
titles[titles.title=='Hamlet'].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [11]:
titles[titles.title=='Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [12]:
titles[titles.year==1950].count()

title    1113
year     1113
dtype: int64

### How many movies were made in the year 1960?

In [13]:
titles[titles.year==1960].count()

title    1549
year     1549
dtype: int64

### How many movies were made from 1950 through 1959?

In [56]:
a = [titles[1959 > titles.year ].year > 1950]
a

[5          True
 8          True
 13        False
 14        False
 19        False
           ...
 244888    False
 244890    False
 244896    False
 244898    False
 244906    False
 Name: year, Length: 46400, dtype: bool]

### In what years has a movie titled "Batman" been released?

In [57]:
titles[titles.title=='Batman']

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [59]:
df = pd.read_csv('cast.csv')
df.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [61]:
df.size

22717056

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [103]:
a = df[df.title=='Inception']
c = a[a.n.isna()].shape[0]
c

27

In [112]:
b = df[df.title=='Inception']
b

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
...,...,...,...,...,...,...
3387147,Inception,2010,Ellen Page,actress,Ariadne,3.0
3444628,Inception,2010,Nicole Pulliam,actress,Lobby Sub Con,43.0
3473041,Inception,2010,Lisa (II) Reynolds,actress,Private Nurse,48.0
3480170,Inception,2010,Talulah Riley,actress,Blonde,25.0
3731263,Inception,2010,Shannon Welles,actress,Old Mal,51.0

### But how many roles in the movie "Inception" did receive an "n" value?

In [108]:
d = a.shape[0]
e = d- c
e

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [123]:
f= df[df.title=='North by Northwest'].sort_values('n')
f.dropna(axis=0).name

871426               Cary Grant
3518333         Eva Marie Saint
1457165             James Mason
3157232     Jessie Royce Landis
356707           Leo G. Carroll
3048272    Josephine Hutchinson
1695173             Philip Ober
1275337           Martin Landau
2447081           Adam Williams
1811387            Edward Platt
665768        Robert Ellenstein
2295714            Les Tremayne
464736          Philip Coolidge
1508344           Patrick McVey
206471             Edward Binns
1384780               Ken Lynch
Name: name, dtype: object

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [134]:
g= df[df.title=='Sleuth'] 
g[g.year==1972].sort_values('n')

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [135]:
h= df[df.title=='Sleuth'] 
h[h.year==2007].sort_values('n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [171]:
i= df[df.title=='Hamlet'] 
j = i[i.year==1921].sort_values('n').shape[0]
j

9

In [179]:
# df[df.title=='Hamlet'][df.year==1921].sort_values('n').shape[0]

### How many roles were credited in Branagh’s 1996 Hamlet?

In [166]:
k = df[df.title=='Hamlet'] 
l = k[k.name=='Kenneth Branagh'].shape[0]
l

1

### How many "Hamlet" roles have been listed in all film credits through history?

In [186]:
m = df[df.title=='Hamlet']
n = m[m.n.isna()].shape[0]
o = df[df.title=='Hamlet']
p = m.shape[0]
p- n

249

### How many people have played an "Ophelia"?

In [165]:
df[df.character=='Ophelia'].shape[0]

117

### How many people have played a role called "The Dude"?

In [188]:
df[df.character=='The Dude'].shape[0]

19

### How many people have played a role called "The Stranger"?

In [190]:
df[df.character=='The Stranger'].shape[0]

212

### How many roles has Sidney Poitier played throughout his career?

In [193]:
df[df.name=='Sidney Poitier'].shape[0]

43

### How many roles has Judi Dench played?

In [194]:
df[df.name=='Judi Dench'].shape[0]

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [201]:
df[df.name=='Cary Grant'][df.year > 1940][df.year < 1950][df.n ==2].shape[0]

C:\Users\anant\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

1

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [205]:
df[df.name=='Cary Grant'][df.year > 1940][df.year < 1950][df.n ==1].character

C:\Users\anant\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

871390                       Mortimer Brewster
871398                           Capt. Cassidy
871402                       Dr. Madison Brown
871411                   Captain Henri Rochard
871421                           Jim Blandings
871422    Joe Adams -posing as Joe Bascopolous
871424                             Cole Porter
871425                              Ernie Mott
871427                                  Devlin
871429                   Patrick 'Pat' O'Toole
871430                             Jerry Flynn
871438                        Johnnie Aysgarth
871444                             Dick Nugent
871445                                  Dudley
871452                            Leopold Dilg
Name: character, dtype: object

### How many roles were available for actors in the 1950s?

In [211]:
df[df.year > 1950][df.year < 1960][df.type == 'actor'].shape[0]

C:\Users\anant\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

140978

### How many roles were available for actresses in the 1950s?

In [212]:
df[df.year > 1950][df.year < 1960][df.type == 'actress'].shape[0]

C:\Users\anant\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

52096

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [213]:
df[df.year < 1980][df.n == 1].shape[0]

C:\Users\anant\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

63957

### How many non-leading roles were available through from the beginning of film history through 1980?

In [214]:
df[df.year < 1980][df.n != 1].shape[0]

C:\Users\anant\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

1095378

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [215]:
df[df.year == 1980][df.n.isna()].shape[0]

C:\Users\anant\anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

4466